ext_alsav/InformationRegisters/алсав_КлючиСекретов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>алсав_КлючиСекретов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/CommonModules/алсав_ВыгрузкаCsvJson/Ext/Module.bsl
Функция СтруктураВjson(Значение)  ЭКСПОРТ

	Если Значение = неопределено Тогда
		возврат "";
	КонецЕсли;

	
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	СтрJSON = ЗаписьJSON.Закрыть();
	
	возврат СтрJSON;

КонецФункции

Функция МассивСтруктурВCSV(данные)ЭКСПОРТ
	Если ЛОЖЬ Тогда данные = новый Массив; КонецЕсли;
	
	контент = "";
	Для Каждого стр из данные Цикл
		Если ЛОЖЬ Тогда стр = Новый Структура; КонецЕсли; 
		мКолонки = новый Массив;
		Для Каждого эл из стр цикл              
			
			знч = "";
			Если ТипЗнч(эл.Значение) = Тип("Число") Тогда 
				знч = НормализоватьЧисло(эл.Значение);
			Иначе
				знч = СокрЛП(Строка(эл.Значение));
			КонецЕсли;
			
			мКолонки.Добавить(знч);			
		КонецЦикла;                
		мКолонки.Добавить(Символы.ПС);
		контент = контент + СтрСоединить(мКолонки,";");
	КонецЦикла;   
	
	Возврат контент;
КонецФункции


Функция СтруктураПреобразоватьЗначенияВСериализуеммыеТипы(стр) Экспорт
	Если ЛОЖЬ Тогда стр = Новый Структура; КонецЕсли;
	
	Для Каждого эл из стр цикл
		значение = эл.Значение;
		
		нЗначение = значение;
		Если значение = Неопределено Тогда
			нЗначение = "";
		ИначеЕсли ТипЗнч(значение) = Тип("Число") Тогда
		ИначеЕсли ТипЗнч(значение) = Тип("Строка") Тогда
		ИначеЕсли ТипЗнч(значение) = Тип("Дата") Тогда
		Иначе
			нЗначение = Строка(значение);
		КонецЕсли;
		
		стр[эл.Ключ] = нЗначение;
	КонецЦикла; 
	
	Возврат стр;
КонецФункции


Функция НормализоватьЧисло(ч)
	 Возврат Формат( ч,"ЧГ=0" );
КонецФункции


// Параметры:
//  ВходящийМассив  - Массив - массив значений для заполнения таблицы;
//  КоличествоПодмассивов - Число - Количество подмассивов которые нужно создать;
//  УдалятьПустые - Булево - Признак что нужно возвращать только заполненные массивы.
Функция РазбитьМассивНаМассивы(ВходящийМассив,КоличествоПодмассивов,УдалятьПустые = Истина) Экспорт

	КоличествоПодмассивов = Окр(КоличествоПодмассивов, 0, РежимОкругления.Окр15как20);
   ПулМассивов = Новый Массив;

   // Готовим массивы
   Для НомерМассива = 1 По КоличествоПодмассивов Цикл
       ПулМассивов.Добавить(Новый Массив);
   КонецЦикла;

   // Переносим массивы
   ТекНомерМассива = 0; // индексы, не забываем
   Для Каждого ТекЭл Из ВходящийМассив Цикл
       ПулМассивов[ТекНомерМассива].Добавить(ТекЭл);
       // говорим в какой поток дальше вставлять данные.
       ТекНомерМассива = ?(ТекНомерМассива=(КоличествоПодмассивов-1),0,ТекНомерМассива+1);
   КонецЦикла;

   // Удаляем пустые
   Если УдалятьПустые Тогда
       МассивУдаления = Новый Массив;
       Для Каждого ТекМассив Из ПулМассивов Цикл
           Если ТекМассив.Количество() = 0 Тогда
                МассивУдаления.Добавить(ТекМассив);
           КонецЕсли;
       КонецЦикла;

       Для Каждого ТекУдМассив Из МассивУдаления Цикл
           Инд = ПулМассивов.Найти(ТекУдМассив);
           ПулМассивов.Удалить(Инд);
       КонецЦикла;
   КонецЕсли;

   Возврат ПулМассивов;
КонецФункции

Функция ПолучитьСекрет(КлючСекрета) Экспорт
	Запись = РегистрыСведений.алсав_КлючиСекретов.ПолучитьПоследнее(Новый Структура("Ключ", КлючСекрета));
	Если Запись = Неопределено Тогда
		ВызватьИсключение("Не найден секрет с ключом: " + КлючСекрета);
	КонецЕсли;
	
	// Читаем значение из безопасного хранилища
	ИмяСекрета = "алсав_Секрет_" + КлючСекрета;
	ЗначениеСекрета = БезопасноеХранилище.Получить(ИмяСекрета, Запись.Пользователь);
	
	Если ЗначениеСекрета = Неопределено Тогда
		ВызватьИсключение("Не удалось получить значение секрета из безопасного хранилища: " + КлючСекрета);
	КонецЕсли;
	
	Возврат ЗначениеСекрета;
КонецФункции

Процедура СохранитьСекрет(КлючСекрета, ЗначениеСекрета, Используется = Истина, Пользователь = Неопределено) Экспорт
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	// Сохраняем значение в безопасное хранилище
	ИмяСекрета = "алсав_Секрет_" + КлючСекрета;
	БезопасноеХранилище.Поместить(ИмяСекрета, ЗначениеСекрета, Пользователь);
	
	// Сохраняем запись в регистр сведений (без значения секрета)
	НаборЗаписей = РегистрыСведений.алсав_КлючиСекретов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ключ.Установить(КлючСекрета);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Ключ = КлючСекрета;
	НоваяЗапись.Используется = Используется;
	НоваяЗапись.Пользователь = Пользователь;
	
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура УдалитьСекрет(КлючСекрета) Экспорт
	Запись = РегистрыСведений.алсав_КлючиСекретов.ПолучитьПоследнее(Новый Структура("Ключ", КлючСекрета));
	Если Запись = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Удаляем из безопасного хранилища
	ИмяСекрета = "алсав_Секрет_" + КлючСекрета;
	БезопасноеХранилище.Удалить(ИмяСекрета, Запись.Пользователь);
	
	// Удаляем запись из регистра сведений
	НаборЗаписей = РегистрыСведений.алсав_КлючиСекретов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ключ.Установить(КлючСекрета);
	НаборЗаписей.Записать();
КонецПроцедуры
